MoonFox2006/ESP32_QRDemo/src/Parameters.cpp
#include <stdio.h>
#include <string.h>
#ifdef ESP32
#include <esp_log.h>
#endif
#include <EEPROM.h>
#ifdef ESP8266
#include <ESP8266WiFi.h>
#else
#include <WiFi.h>
#endif
#include <DNSServer.h>
#include <StreamString.h>
#include "Parameters.h"
#ifdef ESP8266
#include "StrUtils.h"
#endif
#include "Base64.h"

#ifdef ESP32
static const char TAG[] = "Parameters";
#endif

#ifdef ESP8266
static const char EMPTY_PSTR[] PROGMEM = "";

static const char FMT_I8_PSTR[] PROGMEM = "%hhd";
static const char FMT_U8_PSTR[] PROGMEM = "%hhu";
static const char FMT_I16_PSTR[] PROGMEM = "%hd";
static const char FMT_U16_PSTR[] PROGMEM = "%hu";
static const char FMT_I32_PSTR[] PROGMEM = "%d";
static const char FMT_U32_PSTR[] PROGMEM = "%u";
static const char FMT_FLOAT_PSTR[] PROGMEM = "%f";
static const char FMT_IP_PSTR[] PROGMEM = "%hhu.%hhu.%hhu.%hhu";

static const char QUOT_PSTR[] PROGMEM = "&quot;";
static const char LT_PSTR[] PROGMEM = "&lt;";
static const char GT_PSTR[] PROGMEM = "&gt;";

static const char TEXTHTML_PSTR[] PROGMEM = "text/html";
static const char TEXTPLAIN_PSTR[] PROGMEM = "text/plain";
#else
static const char EMPTY_PSTR[] = "";

static const char FMT_I8_PSTR[] = "%hhd";
static const char FMT_U8_PSTR[] = "%hhu";
static const char FMT_I16_PSTR[] = "%hd";
static const char FMT_U16_PSTR[] = "%hu";
static const char FMT_I32_PSTR[] = "%d";
static const char FMT_U32_PSTR[] = "%u";
static const char FMT_FLOAT_PSTR[] = "%f";
static const char FMT_IP_PSTR[] = "%hhu.%hhu.%hhu.%hhu";

static const char QUOT_PSTR[] = "&quot;";
static const char LT_PSTR[] = "&lt;";
static const char GT_PSTR[] = "&gt;";

static const char TEXTHTML_PSTR[] = "text/html";
static const char TEXTPLAIN_PSTR[] = "text/plain";
#endif

bool Parameters::begin() {
  if (! _inited) {
    uint16_t size = sizeof(header_t);

    for (uint16_t i = 0; i < _count; ++i) {
#ifdef ESP8266
      size += pgm_read_word(&_params[i].size);
#else
      size += _params[i].size;
#endif
    }
#ifdef ESP8266
    EEPROM.begin(size);
    _inited = true;
#else
    _inited = EEPROM.begin(size);
    if (! _inited) {
      ESP_LOGE(TAG, "Error allocating of EEPROM (%hu bytes)!", size);
      return false;
    }
#endif
    if (! check()) {
      clear();
#ifdef ESP32
      ESP_LOGW(TAG, "Reset EEPROM parameters!");
#endif
    }
  }
  return _inited;
}

int16_t Parameters::find(const char *name) const {
  for (uint16_t i = 0; i < _count; ++i) {
#ifdef ESP8266
    if (! strcmp_PP((char*)pgm_read_ptr(&_params[i].name), name))
#else
    if (! strcmp(_params[i].name, name))
#endif
      return i;
  }
  return -1;
}

const paraminfo_t *Parameters::getInfo(uint16_t index) const {
  if (index < _count)
    return &_params[index];
  return NULL;
}

const char *Parameters::name(uint16_t index) const {
  if (index < _count)
#ifdef ESP8266
    return (char*)pgm_read_ptr(&_params[index].name);
#else
    return _params[index].name;
#endif
  return NULL;
}

paraminfo_t::paramtype_t Parameters::type(uint16_t index) const {
  if (index < _count)
#ifdef ESP8266
    return (paraminfo_t::paramtype_t)pgm_read_byte(&_params[index].type);
#else
    return _params[index].type;
#endif
}

uint16_t Parameters::size(uint16_t index) const {
  if (index < _count)
#ifdef ESP8266
    return pgm_read_word(&_params[index].size);
#else
    return _params[index].size;
#endif
  return 0;
}

#ifdef ESP8266
const void *Parameters::value(uint16_t index) const {
  const void *result = NULL;

  if (_inited && (index < _count)) {
    result = getPtr(index);

    if (result) {
      paraminfo_t::paramtype_t type = (paraminfo_t::paramtype_t)pgm_read_byte(&_params[index].type);
      uint16_t size = pgm_read_word(&_params[index].size);

      if ((size > 1) && ((type != paraminfo_t::PARAM_STR) && (type != paraminfo_t::PARAM_BINARY))) {
        memcpy((void*)_alignedData, result, size);
        result = _alignedData;
      }
    }
  }
  return result;
}
#endif

bool Parameters::clear() {
  for (uint16_t i = 0; i < _count; ++i) {
    clear(i);
  }
  return update();
}

void Parameters::clear(uint16_t index) {
  if (_inited && (index < _count)) {
#ifdef ESP8266
    switch (pgm_read_byte(&_params[index].type)) {
#else
    switch (_params[index].type) {
#endif
      case paraminfo_t::PARAM_BOOL:
      case paraminfo_t::PARAM_U8:
      case paraminfo_t::PARAM_U16:
      case paraminfo_t::PARAM_I32:
      case paraminfo_t::PARAM_U32:
      case paraminfo_t::PARAM_FLOAT:
      case paraminfo_t::PARAM_CHAR:
        set(index, &_params[index].defvalue);
        break;
      case paraminfo_t::PARAM_I8:
        {
#ifdef ESP8266
          int8_t i8 = (int32_t)pgm_read_dword(&_params[index].defvalue.asint);
#else
          int8_t i8 = _params[index].defvalue.asint;
#endif

          set(index, &i8);
        }
        break;
      case paraminfo_t::PARAM_I16:
        {
#ifdef ESP8266
          int16_t i16 = (int32_t)pgm_read_dword(&_params[index].defvalue.asint);
#else
          int16_t i16 = _params[index].defvalue.asint;
#endif

          set(index, &i16);
        }
        break;
      case paraminfo_t::PARAM_STR:
#ifdef ESP8266
        set(index, pgm_read_ptr(&_params[index].defvalue.asstr));
#else
        set(index, _params[index].defvalue.asstr);
#endif
        break;
      case paraminfo_t::PARAM_BINARY:
#ifdef ESP8266
        set(index, pgm_read_ptr(&_params[index].defvalue.asbinary));
#else
        set(index, _params[index].defvalue.asbinary);
#endif
        break;
      case paraminfo_t::PARAM_IP:
#ifdef ESP8266
        set(index, &_params[index].defvalue.asip[0]);
#else
        set(index, _params[index].defvalue.asip);
#endif
        break;
    }
  }
}

bool Parameters::get(uint16_t index, void *data, uint16_t maxsize) {
  if (_inited && (index < _count) && data && maxsize) {
    const void *ptr = getPtr(index);

    if (ptr) {
#ifdef ESP8266
      paraminfo_t::paramtype_t type = (paraminfo_t::paramtype_t)pgm_read_byte(&_params[index].type);
      uint16_t size = pgm_read_word(&_params[index].size);

      if ((type < paraminfo_t::PARAM_STR) || (type == paraminfo_t::PARAM_IP)) {
        if (maxsize >= size) {
          memcpy(data, ptr, size);
#else
      if ((_params[index].type < paraminfo_t::PARAM_STR) || (_params[index].type == paraminfo_t::PARAM_IP)) {
        if (maxsize >= _params[index].size) {
          memcpy(data, ptr, _params[index].size);
#endif
          return true;
        }
      } else { // type == PARAM_STR or PARAM_BINARY
#ifdef ESP8266
        if (maxsize > size)
          maxsize = size;
        if (type == paraminfo_t::PARAM_STR) {
#else
        if (maxsize > _params[index].size)
          maxsize = _params[index].size;
        if (_params[index].type == paraminfo_t::PARAM_STR) {
#endif
          memcpy(data, ptr, maxsize - 1);
          ((char*)data)[maxsize - 1] = '\0';
        } else { // type == PARAM_BINARY
          memcpy(data, ptr, maxsize);
        }
        return true;
      }
    }
  }
  return false;
}

bool Parameters::set(uint16_t index, const void *data) {
  if (_inited && (index < _count)) {
    void *ptr = getPtr(index);

    if (ptr) {
#ifdef ESP8266
      uint16_t size = pgm_read_word(&_params[index].size);

      memset(ptr, 0, size);
#else
      memset(ptr, 0, _params[index].size);
#endif
      if (data) {
#ifdef ESP8266
        if (pgm_read_byte(&_params[index].type) != paraminfo_t::PARAM_STR) {
          memcpy_P(ptr, data, size);
        } else { // type == PARAM_STR
          strncpy_P((char*)ptr, (char*)data, size - 1);
//          ((char*)ptr)[size - 1] = '\0';
#else
        if (_params[index].type != paraminfo_t::PARAM_STR) {
          memcpy(ptr, data, _params[index].size);
        } else { // type == PARAM_STR
          strncpy((char*)ptr, (char*)data, _params[index].size - 1);
//          ((char*)ptr)[_params[index].size - 1] = '\0';
#endif
        }
      }
      return true;
    }
  }
  return false;
}

String Parameters::toString(uint16_t index, bool encode) {
  if (_inited && (index < _count)) {
    StreamString result;

