MoonFox2006/ESP32_QRDemo/src/Parameters.cpp
    if (toStream(index, result, encode) >= 0)
      return result;
  }
  return String();
}

#ifdef ESP8266
int16_t Parameters::toStream(uint16_t index, Stream &stream, bool encode) {
  int16_t result = -1;

  if (_inited && (index < _count)) {
    const void *ptr = value(index);

    if (ptr) {
      switch (pgm_read_byte(&_params[index].type)) {
        case paraminfo_t::PARAM_BOOL:
          if (*(bool*)ptr)
            result = stream.print(FPSTR((char*)pgm_read_ptr(&BOOLS[true])));
          else
            result = stream.print(FPSTR((char*)pgm_read_ptr(&BOOLS[false])));
          break;
        case paraminfo_t::PARAM_I8:
          result = stream.printf_P(FMT_I8_PSTR, *(int8_t*)ptr);
          break;
        case paraminfo_t::PARAM_U8:
          result = stream.printf_P(FMT_U8_PSTR, *(uint8_t*)ptr);
          break;
        case paraminfo_t::PARAM_I16:
          result = stream.printf_P(FMT_I16_PSTR, *(int16_t*)ptr);
          break;
        case paraminfo_t::PARAM_U16:
          result = stream.printf_P(FMT_U16_PSTR, *(uint16_t*)ptr);
          break;
        case paraminfo_t::PARAM_I32:
          result = stream.printf_P(FMT_I32_PSTR, *(int32_t*)ptr);
          break;
        case paraminfo_t::PARAM_U32:
          result = stream.printf_P(FMT_U32_PSTR, *(uint32_t*)ptr);
          break;
        case paraminfo_t::PARAM_FLOAT:
          result = stream.printf_P(FMT_FLOAT_PSTR, *(float*)ptr);
          break;
        case paraminfo_t::PARAM_CHAR:
          if (encode)
            result = stream.print(encodeString(*(char*)ptr));
          else
            result = stream.print(*(char*)ptr);
          break;
        case paraminfo_t::PARAM_STR:
          if (encode)
            result = stream.print(encodeString((char*)ptr));
          else
            result = stream.print((char*)ptr);
          break;
        case paraminfo_t::PARAM_BINARY:
          result = encodeBase64(stream, (uint8_t*)ptr, pgm_read_word(&_params[index].size));
          break;
        case paraminfo_t::PARAM_IP:
          result = stream.printf_P(FMT_IP_PSTR, (*(paraminfo_t::ipaddr_t*)ptr)[0], (*(paraminfo_t::ipaddr_t*)ptr)[1],
            (*(paraminfo_t::ipaddr_t*)ptr)[2], (*(paraminfo_t::ipaddr_t*)ptr)[3]);
          break;
      }
    }
  }
  return result;
}

#else
int16_t Parameters::toStream(uint16_t index, Stream &stream, bool encode) {
  int16_t result = -1;

  if (_inited && (index < _count)) {
    const void *ptr = getPtr(index);

    if (ptr) {
      switch (_params[index].type) {
        case paraminfo_t::PARAM_BOOL:
          if (*(bool*)ptr)
            result = stream.print(BOOLS[true]);
          else
            result = stream.print(BOOLS[false]);
          break;
        case paraminfo_t::PARAM_I8:
          result = stream.printf(FMT_I8_PSTR, *(int8_t*)ptr);
          break;
        case paraminfo_t::PARAM_U8:
          result = stream.printf(FMT_U8_PSTR, *(uint8_t*)ptr);
          break;
        case paraminfo_t::PARAM_I16:
          result = stream.printf(FMT_I16_PSTR, *(int16_t*)ptr);
          break;
        case paraminfo_t::PARAM_U16:
          result = stream.printf(FMT_U16_PSTR, *(uint16_t*)ptr);
          break;
        case paraminfo_t::PARAM_I32:
          result = stream.printf(FMT_I32_PSTR, *(int32_t*)ptr);
          break;
        case paraminfo_t::PARAM_U32:
          result = stream.printf(FMT_U32_PSTR, *(uint32_t*)ptr);
          break;
        case paraminfo_t::PARAM_FLOAT:
          result = stream.printf(FMT_FLOAT_PSTR, *(float*)ptr);
          break;
        case paraminfo_t::PARAM_CHAR:
          if (encode)
            result = stream.print(encodeString(*(char*)ptr));
          else
            result = stream.print(*(char*)ptr);
          break;
        case paraminfo_t::PARAM_STR:
          if (encode)
            result = stream.print(encodeString((char*)ptr));
          else
            result = stream.print((char*)ptr);
          break;
        case paraminfo_t::PARAM_BINARY:
          result = encodeBase64(stream, (uint8_t*)ptr, _params[index].size);
          break;
        case paraminfo_t::PARAM_IP:
          result = stream.printf(FMT_IP_PSTR, (*(paraminfo_t::ipaddr_t*)ptr)[0], (*(paraminfo_t::ipaddr_t*)ptr)[1],
            (*(paraminfo_t::ipaddr_t*)ptr)[2], (*(paraminfo_t::ipaddr_t*)ptr)[3]);
          break;
      }
    }
  }
  return result;
}
#endif

#ifdef ESP8266
bool Parameters::fromString(uint16_t index, const String &str) {
  bool result = false;

  if (_inited && (index < _count)) {
    void *ptr = getPtr(index);

    if (ptr) {
      uint8_t data[4];

      switch (pgm_read_byte(&_params[index].type)) {
        case paraminfo_t::PARAM_BOOL:
          if (str.equals(FPSTR((char*)pgm_read_ptr(&BOOLS[true]))) || str.equals(F("1"))) {
            *(bool*)ptr = true;
            result = true;
          } else if (str.equals(FPSTR((char*)pgm_read_ptr(&BOOLS[false]))) || str.equals(F("0"))) {
            *(bool*)ptr = false;
            result = true;
          }
          break;
        case paraminfo_t::PARAM_I8:
          result = sscanf_P(str.c_str(), FMT_I8_PSTR, (int8_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_U8:
          result = sscanf_P(str.c_str(), FMT_U8_PSTR, (uint8_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_I16:
          result = sscanf_P(str.c_str(), FMT_I16_PSTR, (int16_t*)data) == 1;
          if (result)
            set(index, data);
          break;
        case paraminfo_t::PARAM_U16:
          result = sscanf_P(str.c_str(), FMT_U16_PSTR, (uint16_t*)data) == 1;
          if (result)
            set(index, data);
          break;
        case paraminfo_t::PARAM_I32:
          result = sscanf_P(str.c_str(), FMT_I32_PSTR, (int32_t*)data) == 1;
          if (result)
            set(index, data);
          break;
        case paraminfo_t::PARAM_U32:
          result = sscanf_P(str.c_str(), FMT_U32_PSTR, (uint32_t*)data) == 1;
          if (result)
            set(index, data);
          break;
        case paraminfo_t::PARAM_FLOAT:
          result = sscanf_P(str.c_str(), FMT_FLOAT_PSTR, (float*)data) == 1;
          if (result)
            set(index, data);
          break;
        case paraminfo_t::PARAM_CHAR:
          *(char*)ptr = str[0];
          result = true;
          break;
        case paraminfo_t::PARAM_STR:
          strncpy((char*)ptr, str.c_str(), pgm_read_word(&_params[index].size) - 1);
          ((char*)ptr)[pgm_read_word(&_params[index].size) - 1] = '\0';
          result = true;
          break;
        case paraminfo_t::PARAM_BINARY:
          result = decodeBase64(str.c_str(), (uint8_t*)ptr, pgm_read_word(&_params[index].size)) != -1;
          break;
        case paraminfo_t::PARAM_IP:
          result = sscanf_P(str.c_str(), FMT_IP_PSTR, &data[0], &data[1], &data[2], &data[3]);
          if (result)
            set(index, data);
          break;
      }
      if (! result) {
        clear(index);
      }
    }
  }
  return result;
}

#else
bool Parameters::fromString(uint16_t index, const String &str) {
  bool result = false;

  if (_inited && (index < _count)) {
    void *ptr = getPtr(index);

    if (ptr) {
      switch (_params[index].type) {
        case paraminfo_t::PARAM_BOOL:
          if (str.equals(BOOLS[true]) || str.equals("1")) {
            *(bool*)ptr = true;
            result = true;
          } else if (str.equals(BOOLS[false]) || str.equals("0")) {
            *(bool*)ptr = false;
            result = true;
          }
          break;
        case paraminfo_t::PARAM_I8:
          result = sscanf(str.c_str(), FMT_I8_PSTR, (int8_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_U8:
          result = sscanf(str.c_str(), FMT_U8_PSTR, (uint8_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_I16:
          result = sscanf(str.c_str(), FMT_I16_PSTR, (int16_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_U16:
          result = sscanf(str.c_str(), FMT_U16_PSTR, (uint16_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_I32:
          result = sscanf(str.c_str(), FMT_I32_PSTR, (int32_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_U32:
          result = sscanf(str.c_str(), FMT_U32_PSTR, (uint32_t*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_FLOAT:
          result = sscanf(str.c_str(), FMT_FLOAT_PSTR, (float*)ptr) == 1;
          break;
        case paraminfo_t::PARAM_CHAR:
          *(char*)ptr = str[0];
          result = true;
          break;
        case paraminfo_t::PARAM_STR:
          strncpy((char*)ptr, str.c_str(), _params[index].size - 1);
          ((char*)ptr)[_params[index].size - 1] = '\0';
          result = true;
          break;
        case paraminfo_t::PARAM_BINARY:
          result = decodeBase64(str.c_str(), (uint8_t*)ptr, _params[index].size) != -1;
          break;
        case paraminfo_t::PARAM_IP:
          result = sscanf(str.c_str(), FMT_IP_PSTR, &(*(paraminfo_t::ipaddr_t*)ptr)[0], &(*(paraminfo_t::ipaddr_t*)ptr)[1],
            &(*(paraminfo_t::ipaddr_t*)ptr)[2], &(*(paraminfo_t::ipaddr_t*)ptr)[3]) == 4;
          break;
      }
      if (! result) {
        clear(index);
      }
    }
  }
  return result;
}
#endif

