MoonFox2006/ESP32_QRDemo/src/Parameters.cpp
bool Parameters::fromStream(uint16_t index, Stream &stream) {
  if (_inited && (index < _count)) {
    return fromString(index, stream.readString());
  }
  return false;
}

#ifdef ESP8266
String Parameters::getScript() {
  return String(F("<script type=\"text/javascript\">\n"
    "function getXmlHttpRequest(){\n"
    "let x;\n"
    "try{\n"
    "x=new ActiveXObject(\"Msxml2.XMLHTTP\");\n"
    "}catch(e){\n"
    "try{\n"
    "x=newActiveXObject(\"Microsoft.XMLHTTP\");\n"
    "}catch(E){\n"
    "x=false;\n"
    "}\n"
    "}\n"
    "if((!x)&&(typeof XMLHttpRequest!='undefined')){\n"
    "x=new XMLHttpRequest();\n"
    "}\n"
    "return x;\n"
    "}\n"
    "function openUrl(u,m){\n"
    "let x=getXmlHttpRequest();\n"
    "x.open(m,u,false);\n"
    "x.send(null);\n"
    "if(x.status!=200){\n"
    "alert(x.responseText);\n"
    "return false;\n"
    "}\n"
    "return true;\n"
    "}\n"
    "function checkInt(e,d,m,x){\n"
    "let n=parseInt(e.value);\n"
    "if(isNaN(n)){\n"
    "n=d;\n"
    "}else{\n"
    "if(n<m)n=m;\n"
    "if(n>x)n=x;\n"
    "}\n"
    "e.value=n.toString();\n"
    "}\n"
    "function checkFloat(e,d,m,x){\n"
    "let n=parseFloat(e.value);\n"
    "if(isNaN(n)){\n"
    "n=d;\n"
    "}else{\n"
    "if((!isNaN(m))&&(n<m))n=m;\n"
    "if((!isNaN(x))&&(n>x))n=x;\n"
    "}\n"
    "if(isNaN(n)){e.value=\"\";\n"
    "}else{\n"
    "e.value=n.toString();\n"
    "}\n"
    "}\n"
    "function processTab(t,e){\n"
    "if(e.which==9){\n"
    "let start=t.selectionStart;\n"
    "let end=t.selectionEnd;\n"
    "t.value=t.value.substr(0,start)+'\t'+t.value.substr(end);\n"
    "t.selectionStart=t.selectionEnd=start+1;\n"
    "e.preventDefault();\n"
    "return false;\n"
    "}\n"
    "}\n"
    "</script>\n"));
}
#else
String Parameters::getScript() {
  return String("<script type=\"text/javascript\">\n"
    "function getXmlHttpRequest(){\n"
    "let x;\n"
    "try{\n"
    "x=new ActiveXObject(\"Msxml2.XMLHTTP\");\n"
    "}catch(e){\n"
    "try{\n"
    "x=newActiveXObject(\"Microsoft.XMLHTTP\");\n"
    "}catch(E){\n"
    "x=false;\n"
    "}\n"
    "}\n"
    "if((!x)&&(typeof XMLHttpRequest!='undefined')){\n"
    "x=new XMLHttpRequest();\n"
    "}\n"
    "return x;\n"
    "}\n"
    "function openUrl(u,m){\n"
    "let x=getXmlHttpRequest();\n"
    "x.open(m,u,false);\n"
    "x.send(null);\n"
    "if(x.status!=200){\n"
    "alert(x.responseText);\n"
    "return false;\n"
    "}\n"
    "return true;\n"
    "}\n"
    "function checkInt(e,d,m,x){\n"
    "let n=parseInt(e.value);\n"
    "if(isNaN(n)){\n"
    "n=d;\n"
    "}else{\n"
    "if(n<m)n=m;\n"
    "if(n>x)n=x;\n"
    "}\n"
    "e.value=n.toString();\n"
    "}\n"
    "function checkFloat(e,d,m,x){\n"
    "let n=parseFloat(e.value);\n"
    "if(isNaN(n)){\n"
    "n=d;\n"
    "}else{\n"
    "if((!isNaN(m))&&(n<m))n=m;\n"
    "if((!isNaN(x))&&(n>x))n=x;\n"
    "}\n"
    "if(isNaN(n)){e.value=\"\";\n"
    "}else{\n"
    "e.value=n.toString();\n"
    "}\n"
    "}\n"
    "function processTab(t,e){\n"
    "if(e.which==9){\n"
    "let start=t.selectionStart;\n"
    "let end=t.selectionEnd;\n"
    "t.value=t.value.substr(0,start)+'\t'+t.value.substr(end);\n"
    "t.selectionStart=t.selectionEnd=start+1;\n"
    "e.preventDefault();\n"
    "return false;\n"
    "}\n"
    "}\n"
    "</script>\n");
}
#endif

#ifdef ESP8266
String Parameters::getEditor(uint16_t index) {
  static const char DISABLED_PSTR[] PROGMEM = " disabled";
  static const char REQUIRED_PSTR[] PROGMEM = " required";
  static const char READONLY_PSTR[] PROGMEM = " readonly";
  static const char CHECKED_PSTR[] PROGMEM = " checked";
  static const char SELECTED_PSTR[] PROGMEM = " selected";
  static const char SIZE_PSTR[] PROGMEM = " size=";
  static const char MAXLENGTH_PSTR[] PROGMEM = " maxlength=";
  static const char NAN_PSTR[] PROGMEM = "NaN";

  if (_inited && (index < _count) && (pgm_read_byte(&_params[index].editor.type) != editor_t::EDIT_NONE) && getPtr(index)) {
    StreamString result;
    editor_t editor;

    memcpy_P(&editor, &_params[index].editor, sizeof(editor_t));
    if (editor.type == editor_t::EDIT_SELECT) {
      result.print(F("<select name=\""));
      result.print(FPSTR((char*)pgm_read_ptr(&_params[index].name)));
      result.print('"');
      if (editor.select.size) {
        result.print(FPSTR(SIZE_PSTR));
        result.print(editor.select.size);
      }
      if (editor.disabled) {
        result.print(FPSTR(DISABLED_PSTR));
      }
      if (editor.required) {
        result.print(FPSTR(REQUIRED_PSTR));
      }
      result.print(F(">\n"));
      if (editor.select.count && editor.select.values) {
        for (uint16_t i = 0; i < editor.select.count; ++i) {
          result.print(F("<option value=\""));
          result.print(encodeString((char*)pgm_read_ptr(&editor.select.values[i])));
          result.print('"');
          if (toString(index).equals(FPSTR((char*)pgm_read_ptr(&editor.select.values[i])))) {
            result.print(FPSTR(SELECTED_PSTR));
          }
          result.print('>');
          if (editor.select.titles)
            result.print(encodeString((char*)pgm_read_ptr(&editor.select.titles[i])));
          else
            result.print(encodeString((char*)pgm_read_ptr(&editor.select.values[i])));
          result.print(F("</option>\n"));
        }
      }
      result.print(F("</select>"));
    } else if (editor.type == editor_t::EDIT_RADIO) {
      if (editor.radio.count && editor.radio.values) {
        for (uint16_t i = 0; i < editor.radio.count; ++i) {
          result.print(F("<input type=\"radio\" name=\""));
          result.print(FPSTR((char*)pgm_read_ptr(&_params[index].name)));
          result.print(F("\" value=\""));
          result.print(encodeString((char*)pgm_read_ptr(&editor.radio.values[i])));
          result.print('"');
          if (toString(index).equals(FPSTR((char*)pgm_read_ptr(&editor.radio.values[i])))) {
            result.print(FPSTR(CHECKED_PSTR));
          }
          if (editor.disabled) {
            result.print(FPSTR(DISABLED_PSTR));
          }
          if (editor.required) {
            result.print(FPSTR(REQUIRED_PSTR));
          }
          if (editor.readonly) {
            result.print(F(" onclick=\"return false;\""));
          }
          result.print('>');
          if (editor.radio.titles)
            result.print(encodeString((char*)pgm_read_ptr(&editor.radio.titles[i])));
          else
            result.print(encodeString((char*)pgm_read_ptr(&editor.radio.values[i])));
          result.print('\n');
        }
      }
    } else if (editor.type == editor_t::EDIT_TEXTAREA) {
      result.print(F("<textarea name=\""));
      result.print(FPSTR((char*)pgm_read_ptr(&_params[index].name)));
      result.print('"');
      if (editor.textarea.cols) {
        result.print(F(" cols="));
        result.print(editor.textarea.cols);
      }
      if (editor.textarea.rows) {
        result.print(F(" rows="));
        result.print(editor.textarea.rows);
      }
      if (editor.textarea.maxlength) {
        result.print(FPSTR(MAXLENGTH_PSTR));
        result.print(editor.textarea.maxlength);
      }
      if (editor.disabled) {
        result.print(FPSTR(DISABLED_PSTR));
      }
      if (editor.required) {
        result.print(FPSTR(REQUIRED_PSTR));
      }
      if (editor.readonly) {
        result.print(FPSTR(READONLY_PSTR));
      }
      result.print(F(" onkeydown=\"processTab(this,event);\">"));
      toStream(index, result, true);
      result.print(F("</textarea>"));
    } else {
      result.print(F("<input type=\""));
      if (editor.type == editor_t::EDIT_TEXT)
        result.print(F("text"));
      else if (editor.type == editor_t::EDIT_PASSWORD)
        result.print(F("password"));
      else if (editor.type == editor_t::EDIT_CHECKBOX)
        result.print(F("checkbox"));
      else if (editor.type == editor_t::EDIT_HIDDEN)
        result.print(F("hidden"));
      result.print(F("\" name=\""));
      result.print(FPSTR((char*)pgm_read_ptr(&_params[index].name)));
      result.print('"');
      if (editor.type != editor_t::EDIT_HIDDEN) {
        if (editor.disabled) {
          result.print(FPSTR(DISABLED_PSTR));
        }
        if (editor.required) {
          result.print(FPSTR(REQUIRED_PSTR));
        }
      }
      if ((editor.type == editor_t::EDIT_TEXT) || (editor.type == editor_t::EDIT_PASSWORD)) {
        if (editor.text.size) {
          result.print(FPSTR(SIZE_PSTR));
          result.print(editor.text.size);
        }
        if (editor.text.maxlength) {
          result.print(FPSTR(MAXLENGTH_PSTR));
          result.print(editor.text.maxlength);
        }
        if (editor.readonly) {
          result.print(FPSTR(READONLY_PSTR));
        }
      } else if (editor.type == editor_t::EDIT_CHECKBOX) {
        result.print(F(" value=\""));
        result.print(encodeString((char*)pgm_read_ptr(&editor.checkbox.checkedvalue)));
        result.print('"');
        if (toString(index).equals(FPSTR((char*)pgm_read_ptr(&editor.checkbox.checkedvalue)))) {
          result.print(FPSTR(CHECKED_PSTR));
        }
        if (editor.readonly) {
          result.print(F(" onclick=\"return false;\""));
        } else {
          result.print(F(" onchange=\"document.getElementsByName('"));
          result.print(FPSTR((char*)pgm_read_ptr(&_params[index].name)));
          result.print(F("')[1].disabled=this.checked;\""));
        }
        result.print(F("><input type=\"hidden\" name=\""));
        result.print(FPSTR((char*)pgm_read_ptr(&_params[index].name)));
        result.print(F("\" value=\""));
        result.print(encodeString((char*)pgm_read_ptr(&editor.checkbox.uncheckedvalue)));
        result.print('"');
        if (toString(index).equals(FPSTR((char*)pgm_read_ptr(&editor.checkbox.checkedvalue)))) {
          result.print(FPSTR(DISABLED_PSTR));
        }
        result.print('>');
      }
      if ((editor.type == editor_t::EDIT_TEXT) || (editor.type == editor_t::EDIT_PASSWORD) ||
        (editor.type == editor_t::EDIT_HIDDEN)) {
        result.print(F(" value=\""));
        toStream(index, result, true);
        result.print('"');
        if (editor.type == editor_t::EDIT_TEXT) {
          if (! editor.readonly) {
            paraminfo_t::paramtype_t type = (paraminfo_t::paramtype_t)pgm_read_byte(&_params[index].type);

