MoonFox2006/ESP32_QRDemo/src/Parameters.cpp
            if ((type >= paraminfo_t::PARAM_I8) && (type <= paraminfo_t::PARAM_U32)) { // Integers
              result.print(F(" onblur=\"checkInt(this,"));
              if ((type == paraminfo_t::PARAM_I8) || (type == paraminfo_t::PARAM_I16) ||
                (type == paraminfo_t::PARAM_I32)) {
                result.printf_P(FMT_I32_PSTR, (int32_t)pgm_read_dword(&_params[index].defvalue.asint));
              } else { // type == PARAM_U8 or PARAM_U16 or PARAM_U32
                result.printf_P(FMT_U32_PSTR, pgm_read_dword(&_params[index].defvalue.asuint));
              }
              result.print(',');
              if ((type == paraminfo_t::PARAM_I8) || (type == paraminfo_t::PARAM_I16) ||
                (type == paraminfo_t::PARAM_I32)) {
                result.printf_P(FMT_I32_PSTR, (int32_t)pgm_read_dword(&_params[index].minvalue.asint));
              } else { // type == PARAM_U8 or PARAM_U16 or PARAM_U32
                result.printf_P(FMT_U32_PSTR, pgm_read_dword(&_params[index].minvalue.asuint));
              }
              result.print(',');
              if ((type == paraminfo_t::PARAM_I8) || (type == paraminfo_t::PARAM_I16) ||
                (type == paraminfo_t::PARAM_I32)) {
                result.printf_P(FMT_I32_PSTR, (int32_t)pgm_read_dword(&_params[index].maxvalue.asint));
              } else { // type == PARAM_U8 or PARAM_U16 or PARAM_U32
                result.printf_P(FMT_U32_PSTR, pgm_read_dword(&_params[index].maxvalue.asuint));
              }
              result.print(F(");\""));
            } else if (type == paraminfo_t::PARAM_FLOAT) {
              result.print(F(" onblur=\"checkFloat(this,"));
              if (isnan(pgm_read_float(&_params[index].defvalue.asfloat))) {
                result.print(FPSTR(NAN_PSTR));
              } else {
                result.printf_P(FMT_FLOAT_PSTR, pgm_read_float(&_params[index].defvalue.asfloat));
              }
              result.print(',');
              if (isnan(pgm_read_float(&_params[index].minvalue.asfloat))) {
                result.print(FPSTR(NAN_PSTR));
              } else {
                result.printf_P(FMT_FLOAT_PSTR, pgm_read_float(&_params[index].minvalue.asfloat));
              }
              result.print(',');
              if (isnan(pgm_read_float(&_params[index].maxvalue.asfloat))) {
                result.print(FPSTR(NAN_PSTR));
              } else {
                result.printf_P(FMT_FLOAT_PSTR, pgm_read_float(&_params[index].maxvalue.asfloat));
              }
              result.print(F(");\""));
            }
          }
        }
        result.print('>');
      }
    }
    return result;
  }
  return String();
}

#else
String Parameters::getEditor(uint16_t index) {
  static const char DISABLED_PSTR[] = " disabled";
  static const char REQUIRED_PSTR[] = " required";
  static const char READONLY_PSTR[] = " readonly";
  static const char CHECKED_PSTR[] = " checked";
  static const char SELECTED_PSTR[] = " selected";
  static const char SIZE_PSTR[] = " size=";
  static const char MAXLENGTH_PSTR[] = " maxlength=";
  static const char NAN_PSTR[] = "NaN";

  if (_inited && (index < _count) && (_params[index].editor.type != editor_t::EDIT_NONE) && getPtr(index)) {
    StreamString result;

    if (_params[index].editor.type == editor_t::EDIT_SELECT) {
      result.print("<select name=\"");
      result.print(_params[index].name);
      result.print('"');
      if (_params[index].editor.select.size) {
        result.print(SIZE_PSTR);
        result.print(_params[index].editor.select.size);
      }
      if (_params[index].editor.disabled) {
        result.print(DISABLED_PSTR);
      }
      if (_params[index].editor.required) {
        result.print(REQUIRED_PSTR);
      }
      result.print(">\n");
      if (_params[index].editor.select.count && _params[index].editor.select.values) {
        for (uint16_t i = 0; i < _params[index].editor.select.count; ++i) {
          result.print("<option value=\"");
          result.print(encodeString(_params[index].editor.select.values[i]));
          result.print('"');
          if (toString(index).equals(_params[index].editor.select.values[i])) {
            result.print(SELECTED_PSTR);
          }
          result.print('>');
          if (_params[index].editor.select.titles)
            result.print(encodeString(_params[index].editor.select.titles[i]));
          else
            result.print(encodeString(_params[index].editor.select.values[i]));
          result.print("</option>\n");
        }
      }
      result.print("</select>");
    } else if (_params[index].editor.type == editor_t::EDIT_RADIO) {
      if (_params[index].editor.radio.count && _params[index].editor.radio.values) {
        for (uint16_t i = 0; i < _params[index].editor.radio.count; ++i) {
          result.print("<input type=\"radio\" name=\"");
          result.print(_params[index].name);
          result.print("\" value=\"");
          result.print(encodeString(_params[index].editor.radio.values[i]));
          result.print('"');
          if (toString(index).equals(_params[index].editor.radio.values[i])) {
            result.print(CHECKED_PSTR);
          }
          if (_params[index].editor.disabled) {
            result.print(DISABLED_PSTR);
          }
          if (_params[index].editor.required) {
            result.print(REQUIRED_PSTR);
          }
          if (_params[index].editor.readonly) {
            result.print(" onclick=\"return false;\"");
          }
          result.print('>');
          if (_params[index].editor.radio.titles)
            result.print(encodeString(_params[index].editor.radio.titles[i]));
          else
            result.print(encodeString(_params[index].editor.radio.values[i]));
          result.print('\n');
        }
      }
    } else if (_params[index].editor.type == editor_t::EDIT_TEXTAREA) {
      result.print("<textarea name=\"");
      result.print(_params[index].name);
      result.print('"');
      if (_params[index].editor.textarea.cols) {
        result.print(" cols=");
        result.print(_params[index].editor.textarea.cols);
      }
      if (_params[index].editor.textarea.rows) {
        result.print(" rows=");
        result.print(_params[index].editor.textarea.rows);
      }
      if (_params[index].editor.textarea.maxlength) {
        result.print(MAXLENGTH_PSTR);
        result.print(_params[index].editor.textarea.maxlength);
      }
      if (_params[index].editor.disabled) {
        result.print(DISABLED_PSTR);
      }
      if (_params[index].editor.required) {
        result.print(REQUIRED_PSTR);
      }
      if (_params[index].editor.readonly) {
        result.print(READONLY_PSTR);
      }
      result.print(" onkeydown=\"processTab(this,event);\">");
      toStream(index, result, true);
      result.print("</textarea>");
    } else {
      result.print("<input type=\"");
      if (_params[index].editor.type == editor_t::EDIT_TEXT)
        result.print("text");
      else if (_params[index].editor.type == editor_t::EDIT_PASSWORD)
        result.print("password");
      else if (_params[index].editor.type == editor_t::EDIT_CHECKBOX)
        result.print("checkbox");
      else if (_params[index].editor.type == editor_t::EDIT_HIDDEN)
        result.print("hidden");
      result.print("\" name=\"");
      result.print(_params[index].name);
      result.print('"');
      if (_params[index].editor.type != editor_t::EDIT_HIDDEN) {
        if (_params[index].editor.disabled) {
          result.print(DISABLED_PSTR);
        }
        if (_params[index].editor.required) {
          result.print(REQUIRED_PSTR);
        }
      }
      if ((_params[index].editor.type == editor_t::EDIT_TEXT) || (_params[index].editor.type == editor_t::EDIT_PASSWORD)) {
        if (_params[index].editor.text.size) {
          result.print(SIZE_PSTR);
          result.print(_params[index].editor.text.size);
        }
        if (_params[index].editor.text.maxlength) {
          result.print(MAXLENGTH_PSTR);
          result.print(_params[index].editor.text.maxlength);
        }
        if (_params[index].editor.readonly) {
          result.print(READONLY_PSTR);
        }
      } else if (_params[index].editor.type == editor_t::EDIT_CHECKBOX) {
        result.print(" value=\"");
        result.print(encodeString(_params[index].editor.checkbox.checkedvalue));
        result.print('"');
        if (toString(index).equals(_params[index].editor.checkbox.checkedvalue)) {
          result.print(CHECKED_PSTR);
        }
        if (_params[index].editor.readonly) {
          result.print(" onclick=\"return false;\"");
        } else {
          result.print(" onchange=\"document.getElementsByName('");
          result.print(_params[index].name);
          result.print("')[1].disabled=this.checked;\"");
        }
        result.print("><input type=\"hidden\" name=\"");
        result.print(_params[index].name);
        result.print("\" value=\"");
        result.print(encodeString(_params[index].editor.checkbox.uncheckedvalue));
        result.print('"');
        if (toString(index).equals(_params[index].editor.checkbox.checkedvalue)) {
          result.print(DISABLED_PSTR);
        }
        result.print('>');
      }
      if ((_params[index].editor.type == editor_t::EDIT_TEXT) || (_params[index].editor.type == editor_t::EDIT_PASSWORD) ||
        (_params[index].editor.type == editor_t::EDIT_HIDDEN)) {
        result.print(" value=\"");
        toStream(index, result, true);
        result.print('"');
        if (_params[index].editor.type == editor_t::EDIT_TEXT) {
          if (! _params[index].editor.readonly) {
            if ((_params[index].type >= paraminfo_t::PARAM_I8) && (_params[index].type <= paraminfo_t::PARAM_U32)) { // Integers
              result.print(" onblur=\"checkInt(this,");
              if ((_params[index].type == paraminfo_t::PARAM_I8) || (_params[index].type == paraminfo_t::PARAM_I16) ||
                (_params[index].type == paraminfo_t::PARAM_I32)) {
                result.printf(FMT_I32_PSTR, _params[index].defvalue.asint);
              } else { // type == PARAM_U8 or PARAM_U16 or PARAM_U32
                result.printf(FMT_U32_PSTR, _params[index].defvalue.asuint);
              }
              result.print(',');
              if ((_params[index].type == paraminfo_t::PARAM_I8) || (_params[index].type == paraminfo_t::PARAM_I16) ||
                (_params[index].type == paraminfo_t::PARAM_I32)) {
                result.printf(FMT_I32_PSTR, _params[index].minvalue.asint);
              } else { // type == PARAM_U8 or PARAM_U16 or PARAM_U32
                result.printf(FMT_U32_PSTR, _params[index].minvalue.asuint);
              }
              result.print(',');
              if ((_params[index].type == paraminfo_t::PARAM_I8) || (_params[index].type == paraminfo_t::PARAM_I16) ||
                (_params[index].type == paraminfo_t::PARAM_I32)) {
                result.printf(FMT_I32_PSTR, _params[index].maxvalue.asint);
              } else { // type == PARAM_U8 or PARAM_U16 or PARAM_U32
                result.printf(FMT_U32_PSTR, _params[index].maxvalue.asuint);
              }
              result.print(");\"");
            } else if (_params[index].type == paraminfo_t::PARAM_FLOAT) {
              result.print(" onblur=\"checkFloat(this,");
              if (isnan(_params[index].defvalue.asfloat)) {
                result.print(NAN_PSTR);
              } else {
                result.printf(FMT_FLOAT_PSTR, _params[index].defvalue.asfloat);
              }
              result.print(',');
              if (isnan(_params[index].minvalue.asfloat)) {
                result.print(NAN_PSTR);
              } else {
                result.printf(FMT_FLOAT_PSTR, _params[index].minvalue.asfloat);
              }
              result.print(',');
              if (isnan(_params[index].maxvalue.asfloat)) {
                result.print(NAN_PSTR);
              } else {
                result.printf(FMT_FLOAT_PSTR, _params[index].maxvalue.asfloat);
              }
              result.print(");\"");
            }
          }
        }
        result.print('>');
      }
    }
    return result;
  }
  return String();
}
#endif

