MoonFox2006/ESP32_QRDemo/src/Parameters.cpp
#ifdef ESP8266
void Parameters::handleWebPage(ESP8266WebServer &http, const char *path) {
  String page;

  if (http.method() == HTTP_GET) {
    http.setContentLength(CONTENT_LENGTH_UNKNOWN);
    http.send(200, FPSTR(TEXTHTML_PSTR), FPSTR(EMPTY_PSTR));
    page = F("<!DOCTYPE html>\n"
      "<html>\n"
      "<head>\n"
      "<title>Parameters</title>\n"
      "<style>\n"
      "body{background-color:#eee;}\n"
      "tr td:first-child{text-align:right;}\n"
      "textarea{resize:none;}\n"
      "</style>\n");
    page.concat(getScript());
    page.concat(F("</head>\n"
      "<body>\n"
      "<form action=\""));
    page.concat(FPSTR(path));
    page.concat(F("\" method=\"post\">\n"
      "<table cols=2>\n"));
    http.sendContent(page);
    for (uint16_t i = 0; i < _count; ++i) {
      if (pgm_read_byte(&_params[i].editor.type) == editor_t::EDIT_NONE)
        continue;
      page = F("<tr><td>");
      if (pgm_read_ptr(&_params[i].title))
        page.concat(encodeString((char*)pgm_read_ptr(&_params[i].title)));
      else
        page.concat(FPSTR((char*)pgm_read_ptr(&_params[i].name)));
      page.concat(F("</td><td>"));
      page.concat(getEditor(i));
      page.concat(F("</td></tr>\n"));
      http.sendContent(page);
    }
    page = F("</table>\n"
      "<p>\n"
      "<input type=\"submit\" value=\"Store\">\n"
      "<input type=\"button\" value=\"Clear\" onclick=\"if(confirm('Are you sure to clear parameters?')){openUrl('");
    page.concat(FPSTR(path));
    page.concat(F("','delete');location.reload();}\">\n"
      "</form>\n"
      "</body>\n"
      "</html>\n"));
    http.sendContent(page);
    http.sendContent(FPSTR(EMPTY_PSTR));
    http.client().stop();
  } else if (http.method() == HTTP_POST) {
    String errors;

    page = F("<!DOCTYPE html>\n"
      "<html>\n"
      "<head>\n"
      "<title>Store parameters</title>\n"
      "<style>\n"
      "body{background-color:#eee;}\n"
      "</style>\n"
      "<meta http-equiv=\"refresh\" content=\"5;URL=");
    page.concat(FPSTR(path));
    page.concat(F("\">\n"
      "</head>\n"
      "<body>\n"));
    for (uint16_t i = 0; i < http.args(); ++i) {
      int16_t param = find(http.argName(i).c_str());

      if (param >= 0) {
        if (! fromString(param, http.arg(i))) {
          errors.concat(F("Error setting parameter \""));
          errors.concat(http.argName(i));
          errors.concat(F("\"!<br>\n"));
        }
      }
    }
    if (! update()) {
      errors.concat(F("Error storing EEPROM parameters!\n"));
    }
    if (errors.isEmpty()) {
      page.concat(F("OK\n"));
    } else {
      page.concat(F("<span style=\"color:red\">\n"));
      page.concat(errors);
      page.concat(F("</span>\n"));
    }
    page.concat(F("<p>\n"
      "Wait for 5 sec. or click <a href=\""));
    page.concat(FPSTR(path));
    page.concat(F("\">this</a> to return to previous page\n"
      "</body>\n"
      "</html>\n"));
    http.send(errors.isEmpty() ? 200 : 400, FPSTR(TEXTHTML_PSTR), page);
  } else if (http.method() == HTTP_DELETE) {
    if (clear()) {
      http.send(200, FPSTR(TEXTPLAIN_PSTR), F("OK"));
    } else {
      http.send(400, FPSTR(TEXTPLAIN_PSTR), F("Error clearing EEPROM parameters!"));
    }
  }
}

#else
void Parameters::handleWebPage(WebServer &http, const char *path) {
  String page;

  if (http.method() == HTTP_GET) {
    http.setContentLength(CONTENT_LENGTH_UNKNOWN);
    http.send(200, TEXTHTML_PSTR, EMPTY_PSTR);
    page = "<!DOCTYPE html>\n"
      "<html>\n"
      "<head>\n"
      "<title>Parameters</title>\n"
      "<style>\n"
      "body{background-color:#eee;}\n"
      "tr td:first-child{text-align:right;}\n"
      "textarea{resize:none;}\n"
      "</style>\n";
    page.concat(getScript());
    page.concat("</head>\n"
      "<body>\n"
      "<form action=\"");
    page.concat(path);
    page.concat("\" method=\"post\">\n"
      "<table cols=2>\n");
    http.sendContent(page);
    for (uint16_t i = 0; i < _count; ++i) {
      if (_params[i].editor.type == editor_t::EDIT_NONE)
        continue;
      page = "<tr><td>";
      if (_params[i].title)
        page.concat(encodeString(_params[i].title));
      else
        page.concat(_params[i].name);
      page.concat("</td><td>");
      page.concat(getEditor(i));
      page.concat("</td></tr>\n");
      http.sendContent(page);
    }
    page = "</table>\n"
      "<p>\n"
      "<input type=\"submit\" value=\"Store\">\n"
      "<input type=\"button\" value=\"Clear\" onclick=\"if(confirm('Are you sure to clear parameters?')){openUrl('";
    page.concat(path);
    page.concat("','delete');location.reload();}\">\n"
      "</form>\n"
      "</body>\n"
      "</html>\n");
    http.sendContent(page);
    http.sendContent(EMPTY_PSTR);
    http.client().stop();
  } else if (http.method() == HTTP_POST) {
    String errors;

    page = "<!DOCTYPE html>\n"
      "<html>\n"
      "<head>\n"
      "<title>Store parameters</title>\n"
      "<style>\n"
      "body{background-color:#eee;}\n"
      "</style>\n"
      "<meta http-equiv=\"refresh\" content=\"5;URL=";
    page.concat(path);
    page.concat("\">\n"
      "</head>\n"
      "<body>\n");
    for (uint16_t i = 0; i < http.args(); ++i) {
      int16_t param = find(http.argName(i).c_str());

      if (param >= 0) {
        if (! fromString(param, http.arg(i))) {
          errors.concat("Error setting parameter \"");
          errors.concat(http.argName(i));
          errors.concat("\"!<br>\n");
        }
      }
    }
    if (! update()) {
      errors.concat("Error storing EEPROM parameters!\n");
    }
    if (errors.isEmpty()) {
      page.concat("OK\n");
    } else {
      page.concat("<span style=\"color:red\">\n");
      page.concat(errors);
      page.concat("</span>\n");
    }
    page.concat("<p>\n"
      "Wait for 5 sec. or click <a href=\"");
    page.concat(path);
    page.concat("\">this</a> to return to previous page\n"
      "</body>\n"
      "</html>\n");
    http.send(errors.isEmpty() ? 200 : 400, TEXTHTML_PSTR, page);
  } else if (http.method() == HTTP_DELETE) {
    if (clear()) {
      http.send(200, TEXTPLAIN_PSTR, "OK");
    } else {
      http.send(400, TEXTPLAIN_PSTR, "Error clearing EEPROM parameters!");
    }
  }
}
#endif

uint16_t Parameters::crc16(uint8_t data, uint16_t crc) {
  crc ^= data << 8;
  for (uint8_t i = 0; i < 8; ++i)
    crc = crc & 0x8000 ? (crc << 1) ^ 0x1021 : crc << 1;
  return crc;
}

uint16_t Parameters::crc16(const uint8_t *data, uint16_t size, uint16_t crc) {
  while (size--) {
    crc ^= *data++ << 8;
    for (uint8_t i = 0; i < 8; ++i)
      crc = crc & 0x8000 ? (crc << 1) ^ 0x1021 : crc << 1;
  }
  return crc;
}

void *Parameters::getPtr(uint16_t index) const {
  void *result = NULL;

  if (_inited && (index < _count)) {
    result = EEPROM.getDataPtr() + sizeof(header_t);
    for (uint16_t i = 0; i < index; ++i) {
#ifdef ESP8266
      result = result + pgm_read_word(&_params[i].size);
#else
      result = result + _params[i].size;
#endif
    }
  }
  return result;
}

