MoonFox2006/ESP32_QRDemo/src/Parameters.cpp
bool Parameters::check() {
  if (_inited) {
    uint8_t *ptr = EEPROM.getDataPtr();
    const header_t *header = (header_t*)ptr;

    if (header->sign == EEPROM_SIGN) {
      uint16_t crc = 0xFFFF;

      ptr += sizeof(header_t);
      for (uint16_t i = 0; i < _count; ++i) {
#ifdef ESP8266
        crc = crc16(ptr, pgm_read_word(&_params[i].size), crc);
        ptr += pgm_read_word(&_params[i].size);
#else
        crc = crc16(ptr, _params[i].size, crc);
        ptr += _params[i].size;
#endif
      }
      return crc == header->crc;
    }
  }
  return false;
}

bool Parameters::update() {
  if (! _inited)
    return false;

  uint8_t *ptr = EEPROM.getDataPtr();
  header_t *header = (header_t*)ptr;
  uint16_t crc = 0xFFFF;

  ptr += sizeof(header_t);
  for (uint16_t i = 0; i < _count; ++i) {
#ifdef ESP8266
    crc = crc16(ptr, pgm_read_word(&_params[i].size), crc);
    ptr += pgm_read_word(&_params[i].size);
#else
    crc = crc16(ptr, _params[i].size, crc);
    ptr += _params[i].size;
#endif
  }
  if ((header->sign != EEPROM_SIGN) || (header->crc != crc)) {
    header->sign = EEPROM_SIGN;
    header->crc = crc;
    return EEPROM.commit();
  }
  return true;
}

String Parameters::encodeString(char c) {
  String result;

  if (c == '"')
#ifdef ESP8266
    result = FPSTR(QUOT_PSTR);
#else
    result = QUOT_PSTR;
#endif
  else if (c == '<')
#ifdef ESP8266
    result = FPSTR(LT_PSTR);
#else
    result = LT_PSTR;
#endif
  else if (c == '>')
#ifdef ESP8266
    result = FPSTR(GT_PSTR);
#else
    result = GT_PSTR;
#endif
  else
    result = c;
  return result;
}

String Parameters::encodeString(const char *str) {
  String result;

  if (str) {
#ifdef ESP8266
    uint16_t len = strlen_P(str);
#else
    uint16_t len = strlen(str);
#endif

    if (result.reserve(len)) {
      for (uint16_t i = 0; i < len; ++i) {
#ifdef ESP8266
        char c = pgm_read_byte(&str[i]);

        if (c == '"')
          result.concat(FPSTR(QUOT_PSTR));
        else if (c == '<')
          result.concat(FPSTR(LT_PSTR));
        else if (c == '>')
          result.concat(FPSTR(GT_PSTR));
        else
          result.concat(c);
#else
        if (str[i] == '"')
          result.concat(QUOT_PSTR);
        else if (str[i] == '<')
          result.concat(LT_PSTR);
        else if (str[i] == '>')
          result.concat(GT_PSTR);
        else
          result.concat(str[i]);
#endif
      }
    }
  }
  return result;
}

static uint8_t findFreeChannel() {
  uint8_t result = 0;
  int16_t networks;

  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  networks = WiFi.scanNetworks(false, true);
  if (networks > 0) {
    int8_t signals[13];

    memset(signals, -128, sizeof(signals));
    for (uint8_t i = 0; i < networks; ++i) {
      uint8_t channel = WiFi.channel(i);
      int8_t rssi = WiFi.RSSI(i);

      if (rssi > signals[channel - 1])
        signals[channel - 1] = rssi;
    }
    for (uint8_t i = 1; i < 13; ++i) {
      if (signals[i] < signals[result])
        result = i;
    }
  }
  WiFi.scanDelete();
  return result + 1;
}

bool paramsCaptivePortal(Parameters *params, const char *ssid, const char *pswd, uint16_t duration, int8_t ledPin, bool ledLevel) {
#ifdef ESP8266
  static const char SLASH_PSTR[] PROGMEM = "/";
#else
  static const char SLASH_PSTR[] = "/";
#endif

  {
    uint8_t channel = findFreeChannel();

    WiFi.mode(WIFI_AP);
#ifdef ESP8266
    {
      char _ssid[strlen_P(ssid) + 1], _pswd[strlen_P(pswd) + 1];

      strcpy_P(_ssid, ssid);
      strcpy_P(_pswd, pswd);
      if (! WiFi.softAP(_ssid, _pswd, channel))
        return false;
    }
#else
    if (! WiFi.softAP(ssid, pswd, channel))
      return false;
#endif
  }

  DNSServer *dns;
#ifdef ESP8266
  ESP8266WebServer *http;
#else
  WebServer *http;
#endif

  dns = new DNSServer();
  if (! dns) {
    WiFi.softAPdisconnect(true);
    return false;
  }
  dns->setErrorReplyCode(DNSReplyCode::NoError);
#ifdef ESP8266
  if (! dns->start(53, F("*"), WiFi.softAPIP())) {
#else
  if (! dns->start(53, "*", WiFi.softAPIP())) {
#endif
    delete dns;
    WiFi.softAPdisconnect(true);
    return false;
  }

#ifdef ESP8266
  http = new ESP8266WebServer();
#else
  http = new WebServer();
#endif
  if (! http) {
    delete dns;
    WiFi.softAPdisconnect(true);
    return false;
  }
  http->onNotFound([&]() {
    if (! http->hostHeader().equals(WiFi.softAPIP().toString())) {
#ifdef ESP8266
      http->sendHeader(F("Location"), String(F("http://")) + WiFi.softAPIP().toString(), true);
      http->send(302, FPSTR(TEXTPLAIN_PSTR), FPSTR(EMPTY_PSTR));
#else
      http->sendHeader("Location", String("http://") + WiFi.softAPIP().toString(), true);
      http->send(302, TEXTPLAIN_PSTR, EMPTY_PSTR);
#endif
      return;
    }

    String page;

#ifdef ESP8266
    page = F("<!DOCTYPE html>\n"
      "<html>\n"
      "<head>\n"
      "<title>Page not found!</title>\n"
      "<style>\n"
      "body{background-color:#eee;}\n"
      "</style>\n"
      "</head>\n"
      "<body>\n"
      "Page <b>");
    page.concat(http->uri());
    page.concat(F("</b> not found!\n"
      "</body>\n"
      "</html>\n"));
    http->send(404, FPSTR(TEXTHTML_PSTR), page);
#else
    page = "<!DOCTYPE html>\n"
      "<html>\n"
      "<head>\n"
      "<title>Page not found!</title>\n"
      "<style>\n"
      "body{background-color:#eee;}\n"
      "</style>\n"
      "</head>\n"
      "<body>\n"
      "Page <b>";
    page.concat(http->uri());
    page.concat("</b> not found!\n"
      "</body>\n"
      "</html>\n");
    http->send(404, TEXTHTML_PSTR, page);
#endif
  });
#ifdef ESP8266
  http->on(FPSTR(SLASH_PSTR), [&]() {
    params->handleWebPage(*http, SLASH_PSTR);
#else
  http->on(SLASH_PSTR, [&]() {
    params->handleWebPage(*http, SLASH_PSTR);
#endif
  });
  http->begin();

  bool blinkFast = false;

  if (ledPin >= 0) {
    pinMode(ledPin, OUTPUT);
    digitalWrite(ledPin, ! ledLevel);
  }

  if (duration) {
    uint32_t start = millis();

    while (millis() - start < duration * 1000) {
      blinkFast = WiFi.softAPgetStationNum() > 0;
      if (blinkFast)
        start = millis();
      dns->processNextRequest();
      http->handleClient();
      if (ledPin >= 0) {
        digitalWrite(ledPin, (millis() % (blinkFast ? 250 : 500) < 25) == ledLevel);
      }
      delay(1);
    }
  } else {
    for (;;) {
      blinkFast = WiFi.softAPgetStationNum() > 0;
      dns->processNextRequest();
      http->handleClient();
      if (ledPin >= 0) {
        digitalWrite(ledPin, (millis() % (blinkFast ? 250 : 500) < 25) == ledLevel);
      }
      delay(1);
    }
  }
  if (ledPin >= 0) {
    digitalWrite(ledPin, ! ledLevel);
  }
  delete http;
  delete dns;
  WiFi.softAPdisconnect();
  return true;
}
